# s.isalpha() возвращает try есле вся строка состоит из букв И НЕТ ПРОБЕЛОВ

# s.isdigit() возвращает try есле вся строка состоит из цифр И НЕТ ПРОБЕЛОВ и НЕТ ЧИСЕЛ С ТОЧКОЙ

# s.isalnum() возвращает try  если  исходная строка из буквенно-цифровых символов.

# s.() возвращает try  если  исходная строка только из пробельных символов.

# s.islower() возвращает try  если  исходная строка только из символов нижнего регистра.

# s.isupper() возвращает try  если  исходная строка только из символов верхнего регистра.

# s.istitle()  возвращает try  если в исходной строке  каждое новое слово начинается с заглавной буквы.
