# s.ljust(10, '-') создаст строку указанной длины и заполнит недостающие символы
# указанным символом с правой стороны от строки
# print('qwerty'.ljust(10, '&'))    # qwerty&&&&
#
# s.rjust(10, '-') создаст строку указанной длины и заполнит недостающие символы
# указанным символом с левой стороны от строки
# print('qwerty'.rjust(10, '&'))    # &&&&qwerty
#
# s.center(10, '-') создаст строку указанной длины и заполнит недостающие символы
# указанным символом с левой и правой стороны от строки
# print('qwerty'.rjust(10, '&'))    # &&qwerty&&
#
# s.zfill(10) создаст строку указанной длины и заполнит недостающие символы нулями
# с левой стороны от строки
# print('qwerty'.zfill(10))    # 0000qwerty