# метод s.replace(старая подстрока,новая подстрока,максимальное число замен)
# меняет значение подстроки на новую подстроку


# s.strip(набор символов) удаляет символы как слева, так и справа строки
# если аргумент не передан удаляться пробелы и символы переноса на новую строку
# print('123_USB_123'.strip('123'))    # _USB_
#
# s.rstrip(набор символов) удаляет символы c права стороны строки
# print('123_USB_123'.rstrip('123'))    # 123_USB_
#
# s.lstrip(набор символов) удаляет символы c левой стороны строки
# print('123_USB_123'.lstrip('123'))    # _USB_123


# s.rpartition(разделитель) разбивает строку по последнему встреченному разделителю
# вернет кортеж из 3 значений (строки до разделителя, разделитель, строки после разделителя)
# "Python is best, isn't it".rpartition('is') # ('Python is best, ', 'is', "n't it")

