# Регулярные выражения, или коротко, регулярки — очень мощный инструмент.
# Использовать их следует с умом и осторожностью, и только там, где они действительно приносят пользу, а не вред:
#
# Плохо написанные регулярные выражения работают медленно
# Их сложно читать, особенно если писал их не ты
# Небольшое изменение задачи приводит к значительному изменению выражения
#
# Приимущества
# Сравнение с шаблоном:
# Регулярные выражения отлично помогают определять, соответствует ли строка тому или иному формату
# – например, телефонному номеру, адресу электронной почты или номеру кредитной карты.
#
# Замена:
# При помощи регулярных выражений легко находить и заменять шаблоны в строке.
#
# Извлечение:
# При помощи регулярных выражений легко извлекать из шаблона фрагменты информации.
#
# Портируемость:
# Почти в любом распространенном языке программирования есть своя библиотека регулярных выражений.
# Синтаксис в основном стандартизирован, поэтому вам не придется переучиваться
# регулярным выражениям при переходе на новый язык.
#
# Четкость и лаконичность:
# Если вы с регулярными выражениями на «ты»,
# то сможете выполнять весьма нетривиальные операции, написав минимальный объем кода.