# Онлайн-сервисы
# https://pythex.org/
#
# Если для тестирования регулярных выражений вам понадобится английский/русский алфавит,
# цифры, или символы - можете воспользоваться следующей строчкой:
# "<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`abcdefghijklmnopqrstuvwxyz{|}
# ~абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
# !"#$%&\'()*+,-./0123456789:;"
# или
# from string import printable
# print(printable)
#
# В некоторых заданиях присутствуют очень большие тесты.
# Ошибку в них найти сложно,
# поэтому нужно использовать сторонние сервисы для сравнения текста.
# https://textcompare.ru/app
# http://text.num2word.ru/