# Математические функции
#
#  - abs() (модуль)
# принимает число  вещественное или комплексное
# возвращает его абсолютное значение
#
#  - bin() (двоичное представление числа)
# преобразует целое число в двоичную строку с префиксом 0b
#
#  - hex() (шестнацетеричное число)
# преобразует целое число в шестнадцатеричную строку с префиксом 0x
#
#  - oct() (восмиричное число)
# преобразует целое число в шестнадцатеричную строку с префиксом 0x
#
#  - round() (округление числа)
# округление происходит до ближайшего четного!!!
# принимает два аргумента
# number — округляемое число
# ndigits — количество знаков после запятой
# возвращает число, округленное до ndigits знаков после десятичной точки
#
#  - pow() (возведения чисел в степень)
# возвращает число base в степени exp, с опциональным делением с остатком на mod
# три аргумента
# base — возводимое число
# exp — число, являющееся степенью
# mod — необязательный аргумент, число, на которое требуется произвести деление с остатком


#  - id()
# возвращает уникальный идентификатор для указанного объекта
#
#  - isinstance()
# проверки принадлежности объекта к некоторому типу данных

