# abs() приобразовывает модуль числа отрицательные в положительные
from unittest import case

# min (1,2,3,4,5) и max(,233,56,6786) Находит меньшие и большее число

# pow(2,3) ВОЗВОДИМ в степень

# round (7,4) ОКРУГЛЯЕТ К БЛИЖАШЕМУ ЦЕЛОМУ 0.5 = 0 все остальные 1.5 = 2

# round (1.342425,2) при перадачи второго параметра указываем сколько знаков после запятой

# math.ceil(5.2) ОКРУГЛЕНИЕ К БОЛЬШЕМУ ЧИСЛУ

# math.floor(5.2) ОКРУГЛЕНИЕ К МЕНЬШЕМУ ЧИСЛУ

# match.factorial(6) ФАКТОРИАЛ

# match.round (7.6) ОТБРАСЫВАЕТ дробную часть как int

# match.log2 (4) ЛОГАРИФМ

# match.sqrt (4) КОРЕНЬ ИЗ КВАДРАТА

