#Перевод чисел в десятичную систему счисления
# number = '11001'
# result = int("2", 2)
# print(result)
#
# print(bin(3)[2:]) # >'1111011'
# print(oct(123)[2:]) # >'173'
# print(hex(123)[2:]) # >'7b'


#- a = format(a, 'b')
# s - строка, можно не указывать, используется по умолчанию;
# b - двоичный формат;
# с - преобразует целое число в символ Unicode;
# d - десятичный формат;
# e - научный формат, со строчной буквой e;
# E - научный формат, с E верхним регистром;
# f - формат чисел с плавающей запятой;
# F - формат чисел с плавающей запятой, верхний регистр;
# g - общий формат, нижний регистр;
# G - общий формат, верхний регистр;
# o - Восьмеричный формат;
# x - шестнадцатеричный формат, нижний регистр;
# X - шестнадцатеричный формат, верхний регистр;
# n - формат целых чисел;
# %- Процентный формат. Умножает число на 100 и использует f для вывода. В конце ставится %;
# #- альтернативный вариант вывода указанного формата, работает с форматами b, o, x.

# print(format(11001, 'x'))