git config --global user.name "свое имя" - установить локально значение для «user.name»

git config --global user.email "свой имейл"  -  установить локально значение для «user.email»

git config -l - покажет текущее имя пользователя и адрес электронной почты в локальном репозитории

mkdir"название папки" - создать папку

cd"название папки" -  зайти в папку

git init . - подключить гит создаст на базе текущей папки "название папки" новый подкаталог

git branch - просмотр существующих локальных и текущей ветвей (с параметром -а вообще всех).

git log - просмотр списка существующих коммитов.

git status – данная команда выводит информацию о статусе файлов, находящихся в репозитории

echo "содержимое файла" > название_файла создает файл с указанным содержимым.

git add -  добавляет файлы в индекс.

git reset - удаляет файлы из индекса

git commit -m – фиксирует добавленные в индекс изменения с определенным сообщением

git push – отправляет изменения на удаленный репозиторий