# возвращает итератор по элементам,
# в котором каждый элемент повторяется столько раз,
# во сколько установлено его значение.
# Элементы возвращаются в порядке их появления

# Если количество элементов по некоторому ключу меньше единицы, то метод просто проигнорирует его.

# from collections import Counter
# letters = Counter('mississippi')
# numbers = Counter([5, 6, 7, 1, 3, 9, 9, 1, 2, 5, 5, 7, 7, 9])
# print(list(letters.elements()))       # ['m', 'i', 'i', 'i', 'i', 's', 's', 's', 's', 'p', 'p']
# print(list(numbers.elements()))       # [5, 5, 5, 6, 7, 7, 7, 1, 1, 3, 9, 9, 9, 2]


