# Все 1 Атрибуты, которыми мы наделяем созданные объекты, хранятся в специальном словаре,
# который доступен в качестве атрибута __dict__

# помимо созданных нами атрибутов класса night_vision и paws_count,
# словарь __dict__ также содержит и другие служебные 1 Атрибуты, в том числе описание самого словаря __dict__


# class Cat:
#     pass
#
#
# cat = Cat()
#
# cat.breed = 'Британский'
# cat.name = 'Кемаль'
# cat.age = 1
#
# print(cat.__dict__)
# выводит:
#
# {'breed': 'Британский', 'name': 'Кемаль', 'age': 1}