# неизменяемый аналог списков
# Если вложен список, то сам список можно изменить
#
# доступ к элементу по индексу (только для получения значений элементов);


# tuple()
# может применяться для преобразования списка в кортеж.
#
# str_list = ['один', 'два', 'три']
# str_tuple = tuple(str_list)
# print(str_tuple)


# Кортежи поддерживают те же операции, что и списки, за исключением изменяющих содержимое.
# Кортежи поддерживают:
# доступ к элементу по индексу (только для получения значений элементов);
# методы, в частности index(), count();
# встроенные функции, в частности len(), sum(), min() и max();
# срезы;
# оператор принадлежности in;
# операторы конкатенации (+) и повторения (*).


