# можно получать информацию о текущих дате и времени,
# выводить эти сведения в необходимом формате, а также управлять ходом
# выполнения программы, добавляя задержки по таймеру.

# если требуется сравнивать или производить арифметические операции со временем,
# то нужно использовать модуль datetime, а не time

# дает возможность:
# отображать информацию о времени, прошедшем с начала эпохи
# преобразовывать значение системного времени к удобному виду
# прерывать выполнение программы (установка паузы) на заданное количество секунд
# измерять время выполнения программы целиком или ее отдельных модулей

