# Comma-Separated Values — значения, разделённые запятыми
# текстовый формат предназначенный для представления табличных данных
# Строка таблицы соответствует строке текста, которая содержит одно или несколько полей, разделенных запятыми.
#
# таблица:
# Rank   Language      Share
#  1	    Python	     31.17%
#  2	    Java	     17.75%
#  3	    JavaScript	 8%
#  4	    C#	         7.05%
#  5	    PHP	         6.09%
#
# в формате csv формат будет выглядеть так:
# Rank,Language,Share
# 1,Python,31.17%
# 2,Java,17.75%
# 3,JavaScript,8%
# 4,C#,7.05%
# 5,PHP,6.09%