# Проект содержит приложения
#
# В Django проектом считается установленный веб-фреймворк Django с несколькими настроечными параметрами.
#
# Приложение – это группа моделей, шаблонов, URL-адресов и представлений.
# Приложения взаимодействуют с веб-фреймворком с целью обеспечения определенного функционала,
# и их можно использовать в разных проектах.
#
# Проект можно трактовать как свой собственный веб-сайт, содержащий несколько приложений,
# таких как блог, вики или форум, который другие проекты Django тоже могут использовать