# Для того чтобы завершить настройку проекта, необходимо создать таблицы, ассоциированные
# с моделями стандартных приложений Django, включенных в состав параметра INSTALLED_APPS.
# Django поставляется вместе с системой, которая помогает управлять миграциями баз данных.
# Откроем командную строку в PyCharm и применим миграции:
# Windows
# python manage.py migrate
# Django создал базу данных SQLite и переместил в нее встроенные приложения, предоставленные нам.
# Это представлено новым файлом db.sqlite3 непосредственно в нашей папке проекта

