# блок for позволяет создавать список на основе любого итерироемого блока для HTML

# {%for<выражение>%}
# <повторяемый фрагмент>
# {%endfor%}

# {% for c in cities -%} с переносом на след строку (строки по порядку)
# {% for c in cities %} пустая строка + перенос на след строку (строки через пустую строку)


# cities = [{'id': 1, "city": "Москва"},
#           {'id': 5, "city": "Тверь"},
#           {'id': 7, "city": "Минск"},
#           {'id': 8, "city": "Смоленск"},
#           {'id': 11, "city": "Калуга"}]
#
# link = '''<select name="cities">
# {% for c in cities -%}
#     <option value="{{c["id"]}}">{{c["city"]}}</option>
# {% endfor -%}
# </select>'''
#
# tm = Template(link)
# msg = tm.render(cities=cities)


# блок if else
# {%if<условие>%}  если условие истина
# <фрагмент при истиности условия> то в шаблон будет помещена строка внутри <>
# {%elif<условие>%}  если условие истина
# <фрагмент при истиности условия> то в шаблон будет помещена строка внутри <>
# {% else %}
# <фрагмент при истиности условия>
# {%endif%}